# DBeam_SetFocusPoint

## Description
Set focus point for the beam

```pascal
PROCEDURE DBeam_SetFocusPoint(pt : REAL);
```

```python
def vs.DBeam_SetFocusPoint(pt):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|pt|REAL|   |

## Examples
```pascal
DBeam_SetFocusPoint(1.0);
```
```python
import vs

# Set focus point for the beam.
pt = 1.0

vs.DBeam_SetFocusPoint(pt)
```

## Version
Availability: from Vectorworks 2011

## Category
* Spotlight